### NaN - Not a Number

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
n = np.nan

In [3]:
type(n)

float

In [4]:
m = 1
m + n

nan

##### Any number add nan will be nan

#### NaN in Series

In [6]:
s1 = Series([1, 2, np.nan, 3, 4], index=['A','B','C','D','E'])

In [7]:
s1

A    1.0
B    2.0
C    NaN
D    3.0
E    4.0
dtype: float64

In [9]:
s1.isnull()

A    False
B    False
C     True
D    False
E    False
dtype: bool

In [10]:
s1.notnull()

A     True
B     True
C    False
D     True
E     True
dtype: bool

In [11]:
s1.dropna()

A    1.0
B    2.0
D    3.0
E    4.0
dtype: float64

## NaN in DataFrame

In [18]:
df = DataFrame([[1,2,3],[np.nan, 5,6],[7,np.nan,9],[np.nan,np.nan,np.nan]])

In [19]:
df

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN

In [20]:
df.isnull()

       0      1      2
0  False  False  False
1   True  False  False
2  False   True  False
3   True   True   True

In [21]:
df.notnull()

       0      1      2
0   True   True   True
1  False   True   True
2   True  False   True
3  False  False  False

In [25]:
df1 = df.dropna(axis=0, how='all') # how = 'any' or 'all', thresh
df1

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [23]:
df2 = df.dropna(axis=1)
df2

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [26]:
df3 = DataFrame([[1,2,3,np.nan],[2,np.nan, 5,6],[np.nan,7,np.nan,9],[1,np.nan,np.nan,np.nan]])

In [37]:
df3

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0
3  1.0  NaN  NaN  NaN

In [29]:
df4 = df3.dropna(thresh=2)
df4

     0    1    2    3
0  1.0  2.0  3.0  NaN
1  2.0  NaN  5.0  6.0
2  NaN  7.0  NaN  9.0

In [38]:
df5 = df3.fillna(value=1)
df5#fill all the nan with value 1

     0    1    2    3
0  1.0  2.0  3.0  1.0
1  2.0  1.0  5.0  6.0
2  1.0  7.0  1.0  9.0
3  1.0  1.0  1.0  1.0

In [40]:
df6 = df3.fillna(value={0:0,1:1,2:2,3:3})
df6

     0    1    2    3
0  1.0  2.0  3.0  3.0
1  2.0  1.0  5.0  6.0
2  0.0  7.0  2.0  9.0
3  1.0  1.0  2.0  3.0

In [41]:
df.dropna() #will not effect the original dataframe

     0    1    2
0  1.0  2.0  3.0

In [42]:
df1

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0

In [43]:
df.fillna(1) #will not effect the original dataframe

     0    1    2
0  1.0  2.0  3.0
1  1.0  5.0  6.0
2  7.0  1.0  9.0
3  1.0  1.0  1.0

In [45]:
df

     0    1    2
0  1.0  2.0  3.0
1  NaN  5.0  6.0
2  7.0  NaN  9.0
3  NaN  NaN  NaN